---
type: WallType
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# WallType

`Autodesk.Revit.DB.WallType` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Function | 2015 | `public WallFunction Function { get ; set ; }` |
| Property | Kind | — | `public WallKind Kind { get ; }` |
| Property | Parameter | — | `` |
| Property | ThermalProperties | 2013 | `public ThermalProperties ThermalProperties { get ; }` |
| Property | Width | — | `public double Width { get ; }` |